Revit 2024 API
ITransientElementMaker.Execute Method
 Implement this method to create transient elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
void Execute()
Visual Basic
Sub Execute
Visual C++
void Execute()
See Also
ITransientElementMaker Interface
Autodesk.Revit.DB Namespace